; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v11 ?v6)
             (pred_11 ?v12 ?v2)
             (pred_9 ?v11 ?v2)
             (pred_6 ?v7 ?v11 )
	     (pred_5 ?v11)
             (pred_10 ?v9)
             (pred_2 ?v12)
             (pred_3 ?v2)
             (pred_12 ?v11)
             (pred_8 ?v12)
             (pred_7 ?v11)
             (pred_1 ))



(:action op_3
:parameters (?v3 ?v10 ?v1 ?v4)
:precondition (and (pred_10 ?v3) (pred_10 ?v10) (pred_2 ?v1) (pred_3 ?v4)
          (pred_4 ?v3 ?v10) (pred_11 ?v1 ?v4)
                   (pred_9 ?v10 ?v4) (pred_5 ?v3) 
                   (pred_12 ?v10) (pred_8 ?v1))
:effect (and  (pred_7 ?v10) (not (pred_12 ?v10))))


(:action op_5
:parameters (?v3 ?v5)
:precondition (and (pred_10 ?v3) (pred_10 ?v5)
               (pred_5 ?v3) (pred_4 ?v3 ?v5) (pred_7 ?v5))
:effect (and (pred_5 ?v5) (not (pred_5 ?v3))))

(:action op_2
:parameters (?v3 ?v1)
:precondition (and (pred_10 ?v3) (pred_2 ?v1) 
                  (pred_5 ?v3) (pred_6 ?v1 ?v3) (pred_1 ))
:effect (and (pred_8 ?v1)
   (not (pred_6 ?v1 ?v3)) (not (pred_1 ))))


(:action op_4
:parameters (?v3 ?v13 ?v8)
:precondition (and (pred_10 ?v3) (pred_2 ?v13) (pred_2 ?v8)
                  (pred_5 ?v3) (pred_8 ?v8) (pred_6 ?v13 ?v3))
:effect (and (pred_8 ?v13) (pred_6 ?v8 ?v3)
        (not (pred_8 ?v8)) (not (pred_6 ?v13 ?v3))))

(:action op_1
:parameters (?v3 ?v1)
:precondition (and (pred_10 ?v3) (pred_2 ?v1) 
                  (pred_5 ?v3) (pred_8 ?v1))
:effect (and (pred_1 ) (pred_6 ?v1 ?v3) (not (pred_8 ?v1)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_07 obj_03 obj_10 obj_09 obj_13 obj_08 obj_05 obj_01
    obj_02 obj_11
    obj_06 obj_12
    )

    (:init
       (pred_1)

       (pred_10 obj_04)
       (pred_10 obj_07)
       (pred_10 obj_03)
       (pred_10 obj_10)
       (pred_10 obj_09)
       (pred_10 obj_13)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_01)
       (pred_3 obj_02)
       (pred_3 obj_11)
       (pred_2 obj_06)
       (pred_2 obj_12)

       (pred_4 obj_04 obj_10)
       (pred_4 obj_04 obj_07)
       (pred_4 obj_07 obj_09)
       (pred_4 obj_07 obj_03)
       (pred_4 obj_07 obj_04)
       (pred_4 obj_03 obj_13)
       (pred_4 obj_03 obj_07)
       (pred_4 obj_10 obj_08)
       (pred_4 obj_10 obj_09)
       (pred_4 obj_10 obj_04)
       (pred_4 obj_09 obj_05)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_09 obj_07)
       (pred_4 obj_09 obj_10)
       (pred_4 obj_13 obj_01)
       (pred_4 obj_13 obj_03)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_08 obj_05)
       (pred_4 obj_08 obj_10)
       (pred_4 obj_05 obj_01)
       (pred_4 obj_05 obj_09)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_01 obj_13)
       (pred_4 obj_01 obj_05)
       (pred_12 obj_07)
       (pred_12 obj_04)
       (pred_9  obj_07 obj_02)
       (pred_9  obj_04 obj_11)
       (pred_7 obj_03)
       (pred_7 obj_10)
       (pred_7 obj_09)
       (pred_7 obj_13)
       (pred_7 obj_08)
       (pred_7 obj_05)
       (pred_7 obj_01)

       (pred_11  obj_06 obj_02)
       (pred_11  obj_12 obj_11)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_12 obj_03)
       (pred_5 obj_08)
    )

    (:goal (and
       (pred_6 obj_06 obj_07)
    ))
(:constraints
  (always (not (pred_5 obj_09)))
)
)

; plan
1. (op_5 obj_08 obj_05)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_05)
   goals met: 0 of 1
2. (op_5 obj_05 obj_01)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_01)
   goals met: 0 of 1
3. (op_5 obj_01 obj_13)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_13)
   goals met: 0 of 1
4. (op_5 obj_13 obj_03)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_03)
   goals met: 0 of 1
5. (op_2 obj_03 obj_06)
   deleted: (pred_6 obj_06 obj_03) (pred_1)
   added: (pred_8 obj_06)
   goals met: 0 of 1
6. (op_3 obj_03 obj_07 obj_06 obj_02)
   deleted: (pred_12 obj_07)
   added: (pred_7 obj_07)
   goals met: 0 of 1
7. (op_5 obj_03 obj_07)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_07)
   goals met: 0 of 1
8. (op_1 obj_07 obj_06)
   deleted: (pred_8 obj_06)
   added: (pred_1) (pred_6 obj_06 obj_07)
   goals met: 1 of 1
